app/controllers/comments_controller.rb

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 145], ["LIMIT", 1]]
---
  def show
    @gossip_id = Gossip.find(params['gossip_id']).id

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 144], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."last_name" = $1 LIMIT $2  [["last_name", "Nymous"], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "gossip_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", ":khfs"], ["gossip_id", 144], ["user_id", 93], ["created_at", "2019-05-01 20:03:50.627242"], ["updated_at", "2019-05-01 20:03:50.627242"]]
---
  def create
    @gossip = Gossip.find(params['gossip_id'])
    @anonymous = User.find_by(last_name: "Nymous")
    @anonymous_id = @anonymous.id
    @comment = Comment.new(content: params[:content], user_id: @anonymous_id, gossip_id: @gossip.id)
    @comment.save

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 144], ["LIMIT", 1]]
UPDATE "comments" SET "content" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["content", "coeur coeur final"], ["updated_at", "2019-05-01 20:23:44.427662"], ["id", 11]]
---
  def update
    @comment = Comment.find(params[:id])
    @gossip_precis = Gossip.find(params[:gossip_id])
    @comment.save

    if @comment.update(content: params[:content])

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 145], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 12]]
---
  def destroy
     @comment = Comment.find(params[:id])
     @gossip_precis = Gossip.find(params[:gossip_id])
     @comment.destroy