app/controllers/gossips_controller.rb

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 61], ["LIMIT", 1]]
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 31], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 42], ["LIMIT", 1]]
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 41], ["LIMIT", 1]]
---
  def show
    @gossip_precis = Gossip.find(params[:id])
    @gossip_user_id = @gossip_precis.user_id
    @gossip_user_city_id = User.find(@gossip_user_id).city_id
    @gossip_user_city = City.find(@gossip_user_city_id).name

SELECT  "users".* FROM "users" WHERE "users"."last_name" = $1 LIMIT $2  [["last_name", "Nymous"], ["LIMIT", 1]]
INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "couco"], ["content", "cocou"], ["user_id", 31], ["created_at", "2019-04-30 15:19:28.287638"], ["updated_at", "2019-04-30 15:19:28.287638"]]
INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "ciao"], ["content", "problems"], ["user_id", 41], ["created_at", "2019-05-01 10:38:52.401017"], ["updated_at", "2019-05-01 10:38:52.401017"]]
---
  def create
    anonymous = User.find_by(last_name: "Nymous")
    @gossip_new = Gossip.new(title: params[:title], content: params[:content], user: anonymous)
    @gossip_new.save

    if @gossip_new.save

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 143], ["LIMIT", 1]]
---
  def edit
    @gossip_precis = Gossip.find(params[:id])

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 63], ["LIMIT", 1]]
UPDATE "gossips" SET "title" = $1, "content" = $2, "updated_at" = $3 WHERE "gossips"."id" = $4  [["title", "Notre titre"], ["content", "Notre potin"], ["updated_at", "2019-05-01 14:05:33.839763"], ["id", 63]]
---
  def update
    @gossip_precis = Gossip.find(params[:id])

    if @gossip_precis.update(gossip_params)

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 63], ["LIMIT", 1]]
DELETE FROM "gossips" WHERE "gossips"."id" = $1  [["id", 63]]
---
  def destroy
        @gossip_precis = Gossip.find(params[:id])
        @gossip_precis.destroy