app/controllers/users_controller.rb

	def show
		@user_precis = User.find(params[:id])
		@user_city_id = @user_precis.city_id
		@user_city = City.find(@user_city_id).name
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 41], ["LIMIT", 1]]